**Data Manipulation**- pandas is used to manipulate data.

Pandas stands for panel Data Structure. It is a data structure that is used to store data in a tabular format. 

It is the core library for data analysis and data manipulation in Python.

In pandas we have single dimensional data as a series object and multidimensional data as a dataframe.

In [2]:
#Let's begin with series object, it is one dimensional array.
#import pandas as pd library
import pandas as pd
s1 = pd.Series([1,2,3,4,5])
print(s1)
#print the type of s1
print(type(s1))
#change the index of s1
s1= pd.Series([1,2,3,4,5], index = ['a','b','c','d','e'])
print(s1)
# you can extract the single element from of s1
print(s1[2])
#you can extract the elements from back of s1 too
print(s1[-3:])

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>
a    1
b    2
c    3
d    4
e    5
dtype: int64
3
c    3
d    4
e    5
dtype: int64

In [3]:
#you can add scalar value to s1
print(s1+10)
#adding two series
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([10,20,30,40,50])
print(s1+s2)

a    11
b    12
c    13
d    14
e    15
dtype: int64
0    11
1    22
2    33
3    44
4    55
dtype: int64

In [4]:
#You can also create a series with a dictionary
s3 = pd.Series({'a':10,'b':20,'c':30,'d':40,'e':50})
print(s3)
#You chanhe the index position of s3
s3 = pd.Series({'a':10,'b':20,'c':30,'d':40,'e':50}, index = ['b','c','d','e','a', 'f'])
print(s3)

a    10
b    20
c    30
d    40
e    50
dtype: int64
b    20.0
c    30.0
d    40.0
e    50.0
a    10.0
f     NaN
dtype: float64

In [5]:
#Now let's create a dataframe, a two dimensional data structure
d1 = pd.DataFrame({"Name":['A', 'B', 'C', 'D', 'E'], "Salary":[1000,2000,3000,4000,5000]})
d1

  Name  Salary
0    A    1000
1    B    2000
2    C    3000
3    D    4000
4    E    5000

In [6]:
#To print first two rows of d1
d1.head(2)

  Name  Salary
0    A    1000
1    B    2000

In [7]:
#Let's load the iris dataset, which is publicly available in sklearn
#Using head() method, we can see the first five rows of the dataset
#using shape method, we can see the number of rows and columns
iris = pd.read_csv('iris.csv')
print(iris.shape)
iris.head()

(150, 6)

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [8]:
#using tail() method, we can see the last five rows of the dataset
iris.tail()

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [9]:
#using columns method, we can see all the columns of the dataset
iris.columns

Index(['Id', 'SepalLengthCm', 'SepalWidthCm', 'PetalLengthCm', 'PetalWidthCm',
       'Species'],
      dtype='object')

In [10]:
#using describe() method, we can see the statistical summary of the dataset
iris.describe()

               Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  150.000000     150.000000    150.000000     150.000000    150.000000
mean    75.500000       5.843333      3.054000       3.758667      1.198667
std     43.445368       0.828066      0.433594       1.764420      0.763161
min      1.000000       4.300000      2.000000       1.000000      0.100000
25%     38.250000       5.100000      2.800000       1.600000      0.300000
50%     75.500000       5.800000      3.000000       4.350000      1.300000
75%    112.750000       6.400000      3.300000       5.100000      1.800000
max    150.000000       7.900000      4.400000       6.900000      2.500000

In [13]:
#using mean() method, we can see the mean of the each column from the dataset
print(iris.mean())

Id               75.500000
SepalLengthCm     5.843333
SepalWidthCm      3.054000
PetalLengthCm     3.758667
PetalWidthCm      1.198667
dtype: float64

C:\Users\KOMAL~1.LAM\AppData\Local\Temp/ipykernel_14272/1352889324.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print(iris.mean())

In [19]:
#using std() method, we can see the standard deviation of the each column from the dataset
iris.std()

C:\Users\KOMAL~1.LAM\AppData\Local\Temp/ipykernel_14272/859722410.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  iris.std()

Id               43.445368
SepalLengthCm     0.828066
SepalWidthCm      0.433594
PetalLengthCm     1.764420
PetalWidthCm      0.763161
dtype: float64

In [16]:
#using min() method, we can see the minimum value of the each column from the dataset
iris.min()

Id                         1
SepalLengthCm            4.3
SepalWidthCm             2.0
PetalLengthCm            1.0
PetalWidthCm             0.1
Species          Iris-setosa
dtype: object

In [17]:
#using max() method, we can see the maximum value of the each column from the dataset
iris.max()

Id                          150
SepalLengthCm               7.9
SepalWidthCm                4.4
PetalLengthCm               6.9
PetalWidthCm                2.5
Species          Iris-virginica
dtype: object

In [51]:
#using iloc method, we can extract the specific numbers of rows and columns, here we extract first 3 rows and 3 columns.
iris.iloc[0:3,0:4]

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm
0   1            5.1           3.5            1.4
1   2            4.9           3.0            1.4
2   3            4.7           3.2            1.3

In [54]:
#using loc method, we can extract the specific rows and columns by giving the number or rows and name of columns which were required 
iris.loc[0:3,("SepalLengthCm","SepalWidthCm")]

   SepalLengthCm  SepalWidthCm
0            5.1           3.5
1            4.9           3.0
2            4.7           3.2
3            4.6           3.1

In [66]:
#using drop() method, we can drop the specific rows and columns.
iris.drop('SepalWidthCm', axis = 1, inplace = True)
iris.head(3)

   Id  SepalLengthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1            1.4           0.2  Iris-setosa
1   2            4.9            1.4           0.2  Iris-setosa
2   3            4.7            1.3           0.2  Iris-setosa

In [67]:
#we can drop specific numbers of rows also.
iris.drop([1,2,3], axis = 0)
iris.head()

   Id  SepalLengthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1            1.4           0.2  Iris-setosa
1   2            4.9            1.4           0.2  Iris-setosa
2   3            4.7            1.3           0.2  Iris-setosa
3   4            4.6            1.5           0.2  Iris-setosa
4   5            5.0            1.4           0.2  Iris-setosa